ETL/Catalogs/ОбъектыКВыгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ОбъектыКВыгрузке</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТаблицыSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQL</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФорматаSQLНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыБазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБазы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СправочникиСтороннихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СправочникиСтороннихСистем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Базы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыКВыгрузке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНазначенияПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазиснаяЕдиница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникиСтороннихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СчетУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СчетУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Субконто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/CommonModules/ЗагрузкаИзФайлаСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

&НаСервере
Функция ПолучитьТипОбъекта(База, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст="ВЫБРАТЬ
	             |	ОбъектыКВыгрузкеТипыБазы.Ссылка КАК Ссылка,
	             |	ОбъектыКВыгрузкеТипыБазы.Ссылка.Наименование КАК Наименование
	             |ИЗ
	             |	Справочник.ОбъектыКВыгрузке.ТипыБазы КАК ОбъектыКВыгрузкеТипыБазы
	             |ГДЕ
	             |	ОбъектыКВыгрузкеТипыБазы.ТипБазы В
	             |			(ВЫБРАТЬ
	             |				Базы.ТипБазы КАК ТипБазы
	             |			ИЗ
	             |				Справочник.Базы КАК Базы
	             |			ГДЕ
	             |				Базы.Ссылка = &База)
	             |	И ОбъектыКВыгрузкеТипыБазы.Ссылка.Наименование = &Наименование
	             |	И НЕ ОбъектыКВыгрузкеТипыБазы.Ссылка.ПометкаУдаления
	             |	И ОбъектыКВыгрузкеТипыБазы.Ссылка.Выгружать";
	
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("Наименование", Наименование);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
		//автоматои не создаем так ккак объект требует ручной настройки на таблицы
	КонецЕсли;
		
	Возврат Результат;

КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьЭлементСправочникаПоНаименованию(База, ТипСправочника, Наименование, СтруктураДопПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст="ВЫБРАТЬ
	             |	СправочникиСтороннихСистем.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.СправочникиСтороннихСистем КАК СправочникиСтороннихСистем
	             |ГДЕ
	             |	СправочникиСтороннихСистем.Наименование = &Наименование
	             |	И СправочникиСтороннихСистем.ТипСправочника = &ТипСправочника
	             |	И СправочникиСтороннихСистем.Владелец = &База";
	
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("ТипСправочника", ТипСправочника);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Если СтруктураДопПараметров = Неопределено Тогда
			СтруктураДопПараметров = Новый Структура;
		КонецЕСли;
		СтруктураДопПараметров.Вставить("База", База);
		СтруктураДопПараметров.Вставить("ТипСправочника", ТипСправочника);
		СтруктураДопПараметров.Вставить("Наименование", СокрЛП(Наименование));

		Результат = СоздатьЭлементСправочника(СтруктураДопПараметров);
	Иначе
		//обновим загрженные
		Если СтруктураДопПараметров.Свойство("БИН") тогда
			Если СтруктураДопПараметров.Бин<>"" Тогда
				СпрОбъект = Результат.ПолучитьОбъект();
				СпрОбъект.БИН = СтруктураДопПараметров.Бин;
				СпрОбъект.Записать();
			КонецЕсли;
		ИначеЕсли СтруктураДопПараметров.Свойство("КонтрагентВладелец") тогда 
			Если ЗначениеЗаполнено(СтруктураДопПараметров.КонтрагентВладелец) Тогда
				СпрОбъект = Результат.ПолучитьОбъект();
				СпрОбъект.КонтрагентВладелец = СтруктураДопПараметров.КонтрагентВладелец;
				СпрОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕСли;
		
	Возврат Результат;

КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьЭлементСправочникаПоКоду(База, ТипСправочника, Код, СтруктураДопПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст="ВЫБРАТЬ
	             |	СправочникиСтороннихСистем.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.СправочникиСтороннихСистем КАК СправочникиСтороннихСистем
	             |ГДЕ
	             |	СправочникиСтороннихСистем.ВходящийКод = &Код
	             |	И СправочникиСтороннихСистем.ТипСправочника = &ТипСправочника
	             |	И СправочникиСтороннихСистем.Владелец = &База";
	
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("ТипСправочника", ТипСправочника);
	Запрос.УстановитьПараметр("Код", СокрЛП(Код));

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Если СтруктураДопПараметров - Неопределено Тогда
			СтруктураДопПараметров = Новый Структура;
		КонецЕСли;
		СтруктураДопПараметров.Вставить("База", База);
		СтруктураДопПараметров.Вставить("ТипСправочника", ТипСправочника);
		СтруктураДопПараметров.Вставить("Код", СокрЛП(Код));

		Результат = СоздатьЭлементСправочника(СтруктураДопПараметров);
	КонецЕСли;
		
	Возврат Результат;

КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьЭлементСправочникаПоБин(База, ТипСправочника, Бин, СтруктураДопПараметров = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст="ВЫБРАТЬ
	             |	СправочникиСтороннихСистем.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.СправочникиСтороннихСистем КАК СправочникиСтороннихСистем
	             |ГДЕ
	             |	СправочникиСтороннихСистем.Бин = &Бин
	             |	И СправочникиСтороннихСистем.ТипСправочника = &ТипСправочника
	             |	И СправочникиСтороннихСистем.Владелец = &База";
	
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("ТипСправочника", ТипСправочника);
	Запрос.УстановитьПараметр("Бин", Бин);

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Если СтруктураДопПараметров - Неопределено Тогда
			СтруктураДопПараметров = Новый Структура;
		КонецЕСли;
		СтруктураДопПараметров.Вставить("База", База);
		СтруктураДопПараметров.Вставить("ТипСправочника", ТипСправочника);
		СтруктураДопПараметров.Вставить("Бин", Бин);

		Результат = СоздатьЭлементСправочника(СтруктураДопПараметров);
	КонецЕСли;
		
	Возврат Результат;

КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция ПолучитьСчет(База, Код, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	ЗАпрос.Текст="ВЫБРАТЬ
	             |	СчетУчета.Ссылка КАК Ссылка,
	             |	СчетУчета.Код КАК Код,
	             |	СчетУчета.Наименование КАК Наименование
	             |ИЗ
	             |	Справочник.СчетУчета КАК СчетУчета
	             |ГДЕ
	             |	СчетУчета.Код = &Код
	             |	И СчетУчета.База = &База";
	
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("Код", СокрЛП(Код));

	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда

		НовыйСчет = Справочники.СчетУчета.СоздатьЭлемент();
		НовыйСчет.Код = СокрЛП(Код);
		НовыйСчет.Наименование = СокрЛП(Наименование);
		НовыйСчет.База = База;
		НовыйСчет.Записать();
		
		Результат = НовыйСчет.Ссылка;
		
	КонецЕСли;
		
	Возврат Результат;

КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Функция СоздатьЭлементСправочника(СтруктураДопПараметров) Экспорт
	
	Результат = Неопределено;
	Если СтруктураДопПараметров.ТипСправочника <> Неопределено Тогда
		НовыйЭлемент = Справочники.СправочникиСтороннихСистем.СоздатьЭлемент();
		НовыйЭлемент.Владелец = СтруктураДопПараметров.База;
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.ТипСправочника = СтруктураДопПараметров.ТипСправочника;
		Если СтруктураДопПараметров.Свойство("Наименование") Тогда
			НовыйЭлемент.Наименование = СокрЛП(СтруктураДопПараметров.Наименование);
		КонецЕсли;
		Если СтруктураДопПараметров.Свойство("Код") Тогда
			НовыйЭлемент.ВходящийКод =  СокрЛП(СтруктураДопПараметров.Код);		
		КонецЕсли;
		Если СтруктураДопПараметров.Свойство("БИН") Тогда
			НовыйЭлемент.БИН =  СокрЛП(СтруктураДопПараметров.БИН);
		КонецЕсли;
		Если СтруктураДопПараметров.Свойство("БазиснаяЕдиница") Тогда
			НовыйЭлемент.БазиснаяЕдиница =  СокрЛП(СтруктураДопПараметров.БазиснаяЕдиница);
		КонецЕсли;
		Если СтруктураДопПараметров.Свойство("КонтрагентВладелец") Тогда
			НовыйЭлемент.КонтрагентВладелец =  СтруктураДопПараметров.КонтрагентВладелец;
		КонецЕсли;
		
		НовыйЭлемент.Записать();
		Результат = НовыйЭлемент.Ссылка;
	КонецЕСли;
	
	Возврат Результат; 

КонецФункции // СоздатьЭлементСправочника()

&НаСервере
Функция ПолучитьСоответсвиеДляОстатка() Экспорт

	//СоответствиеКолонок =  Новый Соответствие;
	//СоответствиеКолонок.Вставить("Столбец_41", "Контрагенты");
	//СоответствиеКолонок.Вставить("Столбец_40", "НоменклатурныеГруппы"); //Группа материалов
	//СоответствиеКолонок.Вставить("Столбец_39", "РасходыБудущихПериодов");
	//СоответствиеКолонок.Вставить("Столбец_38", "СтатьиЗатрат");
	//СоответствиеКолонок.Вставить("Столбец_37", "СтатьиДвиженияДенежныхСредств");
	//СоответствиеКолонок.Вставить("Столбец_36", "Договоры");
	////СоответствиеКолонок.Вставить("Столбец_35", "Склады"); //Склады игнорируем
	//СоответствиеКолонок.Вставить("Столбец_34", "ЦенныеБумаги");
	//СоответствиеКолонок.Вставить("Столбец_33", "ОбъектыСтроительства");
	//СоответствиеКолонок.Вставить("Столбец_32", "ОсновныеСредства");
	//СоответствиеКолонок.Вставить("Столбец_31", "НематериальныеАктивы");
	//СоответствиеКолонок.Вставить("Столбец_30", "ДоходыБудущихПериодов");
	//СоответствиеКолонок.Вставить("Столбец_29", "СтатьиДоходов");
	//СоответствиеКолонок.Вставить("Столбец_28", "Кассы");
	//СоответствиеКолонок.Вставить("Столбец_27", "БанковскиеСчета");
	////СоответствиеКолонок.Вставить("Столбец_26", "КодНазначенияПлатежа"); //куда не знаю
	//СоответствиеКолонок.Вставить("Столбец_25", "Номенклатура");
	//СоответствиеКолонок.Вставить("Столбец_24", "Склад_Код");  //Склады игнорируем
	////СоответствиеКолонок.Вставить("Столбец_23", "Завод"); //судя по аналитике это склад. не учитываем
	//СоответствиеКолонок.Вставить("Столбец_22", "БИН");
	//СоответствиеКолонок.Вставить("Столбец_21", "Кредитор_Код");
	//СоответствиеКолонок.Вставить("Столбец_20", "Дебитор_Код");
	////СоответствиеКолонок.Вставить("Столбец_19", "Субномер"); //поле не просили, в ней какая то хрень понятная только специалистом SAP c 20 летним стажем
	//СоответствиеКолонок.Вставить("Столбец_18", "ОсновныеСредства_Код");
	//СоответствиеКолонок.Вставить("Столбец_17", "Номенклатура_Код");
	//СоответствиеКолонок.Вставить("Столбец_16", "БазиснаяЕдиница");
	//СоответствиеКолонок.Вставить("Столбец_15", "Количество");
	//СоответствиеКолонок.Вставить("Столбец_14", "СуммаВУпрВалюте");
	//СоответствиеКолонок.Вставить("Столбец_13", "СуммаВТенге");
	//СоответствиеКолонок.Вставить("Столбец_12", "СуммаВВалюте");
	//СоответствиеКолонок.Вставить("Столбец_11", "Валюта");
	////СоответствиеКолонок.Вставить("Столбец_10", "ТипРегистратора");  для остатков непонятно чем специалисты SAP его заполнили
	//СоответствиеКолонок.Вставить("Столбец_9", "Счет_Наименование");
	//СоответствиеКолонок.Вставить("Столбец_8", "Счет_Код");
	//СоответствиеКолонок.Вставить("Столбец_7", "Период_Месяц");
	//СоответствиеКолонок.Вставить("Столбец_6", "Период_Год");
	////СоответствиеКолонок.Вставить("Столбец_5", "Подразделение"); В подразделение переносим данные из колонки "Структурное подразделение". Это подразделение опускаем
	//СоответствиеКолонок.Вставить("Столбец_4", "ДатаВвода"); //информации в выгрузке нет 
	//СоответствиеКолонок.Вставить("Столбец_3", "Период");
	//СоответствиеКолонок.Вставить("Столбец_2", "Подразделение");
	//СоответствиеКолонок.Вставить("Столбец_1", "Подразделение_Код");
	
	СоответствиеКолонок =  Новый Соответствие;
	СоответствиеКолонок.Вставить("Контрагенты", "Столбец_41");
	СоответствиеКолонок.Вставить("НоменклатурныеГруппы", "Столбец_40"); //Группа материалов
	СоответствиеКолонок.Вставить("РасходыБудущихПериодов", "Столбец_39");
	СоответствиеКолонок.Вставить("СтатьиЗатрат", "Столбец_38");
	СоответствиеКолонок.Вставить("СтатьиДвиженияДенежныхСредств", "Столбец_37");
	СоответствиеКолонок.Вставить("Договоры", "Столбец_36");
	//СоответствиеКолонок.Вставить("Столбец_35", "Склады"); //Склады игнорируем
	СоответствиеКолонок.Вставить("ЦенныеБумаги", "Столбец_34");
	СоответствиеКолонок.Вставить("ОбъектыСтроительства", "Столбец_33");
	СоответствиеКолонок.Вставить("ОсновныеСредства", "Столбец_32");
	СоответствиеКолонок.Вставить("НематериальныеАктивы", "Столбец_31");
	СоответствиеКолонок.Вставить("ДоходыБудущихПериодов", "Столбец_30" );
	СоответствиеКолонок.Вставить("СтатьиДоходов", "Столбец_29");
	СоответствиеКолонок.Вставить("Кассы", "Столбец_28");
	СоответствиеКолонок.Вставить("БанковскиеСчета", "Столбец_27");
	//СоответствиеКолонок.Вставить("Столбец_26", "КодНазначенияПлатежа"); //куда не знаю
	СоответствиеКолонок.Вставить("Номенклатура", "Столбец_25");
	//СоответствиеКолонок.Вставить("Склад_Код", "Столбец_24");  //Склады игнорируем
	//СоответствиеКолонок.Вставить("Столбец_23", "Завод"); //судя по аналитике это склад. не учитываем
	СоответствиеКолонок.Вставить("БИН", "Столбец_22");
	СоответствиеКолонок.Вставить("Кредитор_Код", "Столбец_21");
	СоответствиеКолонок.Вставить("Дебитор_Код", "Столбец_20");
	//СоответствиеКолонок.Вставить("Столбец_19", "Субномер"); //поле не просили, в ней какая то хрень понятная только специалистом SAP c 20 летним стажем
	СоответствиеКолонок.Вставить("ОсновныеСредства_Код", "Столбец_18");
	СоответствиеКолонок.Вставить("Номенклатура_Код", "Столбец_17" );
	СоответствиеКолонок.Вставить("БазиснаяЕдиница", "Столбец_16" );
	СоответствиеКолонок.Вставить("Количество", "Столбец_15");
	СоответствиеКолонок.Вставить("СуммаВУпрВалюте", "Столбец_14");
	СоответствиеКолонок.Вставить("СуммаВТенге", "Столбец_13");
	СоответствиеКолонок.Вставить("СуммаВВалюте", "Столбец_12");
	СоответствиеКолонок.Вставить("Валюта", "Столбец_11");
	//СоответствиеКолонок.Вставить("Столбец_10", "ТипРегистратора");  для остатков непонятно чем специалисты SAP его заполнили
	СоответствиеКолонок.Вставить("Счет_Наименование", "Столбец_9");
	СоответствиеКолонок.Вставить("Счет_Код", "Столбец_8");
	СоответствиеКолонок.Вставить("Период_Месяц", "Столбец_7");
	СоответствиеКолонок.Вставить("Период_Год", "Столбец_6");
	//СоответствиеКолонок.Вставить("Столбец_5", "Подразделение"); В подразделение переносим данные из колонки "Структурное подразделение". Это подразделение опускаем
	СоответствиеКолонок.Вставить("ДатаВвода", "Столбец_4" ); //информации в выгрузке нет 
	СоответствиеКолонок.Вставить("Период", "Столбец_3");
	СоответствиеКолонок.Вставить("Подразделение", "Столбец_2");
	СоответствиеКолонок.Вставить("Подразделение_Код", "Столбец_1");
	
	Возврат СоответствиеКолонок;

КонецФункции // ПолучитьСоответсвиеДляОстатка()

&НаСервере
Функция ПолучитьСоответсвиеДляОборотов() Экспорт

	//// на текущий момент соответсвия совпадают но они могут потом отличаться
	//СоответствиеКолонок =  Новый Соответствие;
	//СоответствиеКолонок.Вставить("Столбец_41", "Контрагенты");
	//СоответствиеКолонок.Вставить("Столбец_40", "НоменклатурныеГруппы"); //Группа материалов
	//СоответствиеКолонок.Вставить("Столбец_39", "РасходыБудущихПериодов");
	//СоответствиеКолонок.Вставить("Столбец_38", "СтатьиЗатрат");
	//СоответствиеКолонок.Вставить("Столбец_37", "СтатьиДвиженияДенежныхСредств");
	//СоответствиеКолонок.Вставить("Столбец_36", "Договоры");
	////СоответствиеКолонок.Вставить("Столбец_35", "Склады"); //Склады игнорируем
	//СоответствиеКолонок.Вставить("Столбец_34", "ЦенныеБумаги");
	//СоответствиеКолонок.Вставить("Столбец_33", "ОбъектыСтроительства");
	//СоответствиеКолонок.Вставить("Столбец_32", "ОсновныеСредства");
	//СоответствиеКолонок.Вставить("Столбец_31", "НематериальныеАктивы");
	//СоответствиеКолонок.Вставить("Столбец_30", "ДоходыБудущихПериодов");
	//СоответствиеКолонок.Вставить("Столбец_29", "СтатьиДоходов");
	//СоответствиеКолонок.Вставить("Столбец_28", "Кассы");
	//СоответствиеКолонок.Вставить("Столбец_27", "БанковскиеСчета");
	////СоответствиеКолонок.Вставить("Столбец_26", "КодНазначенияПлатежа"); //куда не знаю
	//СоответствиеКолонок.Вставить("Столбец_25", "Номенклатура");
	//СоответствиеКолонок.Вставить("Столбец_24", "Склад_Код");  //Склады игнорируем
	////СоответствиеКолонок.Вставить("Столбец_23", "Завод"); //судя по аналитике это склад. не учитываем
	//СоответствиеКолонок.Вставить("Столбец_22", "БИН");
	//СоответствиеКолонок.Вставить("Столбец_21", "Кредитор_Код");
	//СоответствиеКолонок.Вставить("Столбец_20", "Дебитор_Код");
	////СоответствиеКолонок.Вставить("Столбец_19", "Субномер"); //поле не просили, в ней какая то хрень понятная только специалистом SAP c 20 летним стажем
	//СоответствиеКолонок.Вставить("Столбец_18", "ОсновныеСредства_Код");
	//СоответствиеКолонок.Вставить("Столбец_17", "Номенклатура_Код");
	//СоответствиеКолонок.Вставить("Столбец_16", "БазиснаяЕдиница");
	//СоответствиеКолонок.Вставить("Столбец_15", "Количество");
	//СоответствиеКолонок.Вставить("Столбец_14", "СуммаВУпрВалюте");
	//СоответствиеКолонок.Вставить("Столбец_13", "СуммаВТенге");
	//СоответствиеКолонок.Вставить("Столбец_12", "СуммаВВалюте");
	//СоответствиеКолонок.Вставить("Столбец_11", "Валюта");
	//СоответствиеКолонок.Вставить("Столбец_10", "ТипРегистратора");  
	//СоответствиеКолонок.Вставить("Столбец_9", "Счет_Наименование");
	//СоответствиеКолонок.Вставить("Столбец_8", "Счет_Код");
	//СоответствиеКолонок.Вставить("Столбец_7", "Период_Месяц");
	//СоответствиеКолонок.Вставить("Столбец_6", "Период_Год");
	////СоответствиеКолонок.Вставить("Столбец_5", "Подразделение"); В подразделение переносим данные из колонки "Структурное подразделение". Это подразделение опускаем
	//СоответствиеКолонок.Вставить("Столбец_4", "ДатаВвода"); //информации в выгрузке нет 
	//СоответствиеКолонок.Вставить("Столбец_3", "Период");
	//СоответствиеКолонок.Вставить("Столбец_2", "Подразделение");
	//СоответствиеКолонок.Вставить("Столбец_1", "Подразделение_Код");
	
	СоответствиеКолонок =  Новый Соответствие;
	СоответствиеКолонок.Вставить("Контрагенты", "Столбец_41");
	СоответствиеКолонок.Вставить("НоменклатурныеГруппы", "Столбец_40"); //Группа материалов
	СоответствиеКолонок.Вставить("РасходыБудущихПериодов", "Столбец_39");
	СоответствиеКолонок.Вставить("СтатьиЗатрат", "Столбец_38");
	СоответствиеКолонок.Вставить("СтатьиДвиженияДенежныхСредств", "Столбец_37");
	СоответствиеКолонок.Вставить("Договоры", "Столбец_36");
	//СоответствиеКолонок.Вставить("Столбец_35", "Склады"); //Склады игнорируем
	СоответствиеКолонок.Вставить("ЦенныеБумаги", "Столбец_34");
	СоответствиеКолонок.Вставить("ОбъектыСтроительства", "Столбец_33");
	СоответствиеКолонок.Вставить("ОсновныеСредства", "Столбец_32");
	СоответствиеКолонок.Вставить("НематериальныеАктивы", "Столбец_31");
	СоответствиеКолонок.Вставить("ДоходыБудущихПериодов", "Столбец_30" );
	СоответствиеКолонок.Вставить("СтатьиДоходов", "Столбец_29");
	СоответствиеКолонок.Вставить("Кассы", "Столбец_28");
	СоответствиеКолонок.Вставить("БанковскиеСчета", "Столбец_27");
	//СоответствиеКолонок.Вставить("Столбец_26", "КодНазначенияПлатежа"); //куда не знаю
	СоответствиеКолонок.Вставить("Номенклатура", "Столбец_25");
	//СоответствиеКолонок.Вставить("Склад_Код", "Столбец_24");  //Склады игнорируем
	//СоответствиеКолонок.Вставить("Столбец_23", "Завод"); //судя по аналитике это склад. не учитываем
	СоответствиеКолонок.Вставить("БИН", "Столбец_22");
	СоответствиеКолонок.Вставить("Кредитор_Код", "Столбец_21");
	СоответствиеКолонок.Вставить("Дебитор_Код", "Столбец_20");
	//СоответствиеКолонок.Вставить("Столбец_19", "Субномер"); //поле не просили, в ней какая то хрень понятная только специалистом SAP c 20 летним стажем
	СоответствиеКолонок.Вставить("ОсновныеСредства_Код", "Столбец_18");
	СоответствиеКолонок.Вставить("Номенклатура_Код", "Столбец_17" );
	СоответствиеКолонок.Вставить("БазиснаяЕдиница", "Столбец_16" );
	СоответствиеКолонок.Вставить("Количество", "Столбец_15");
	СоответствиеКолонок.Вставить("СуммаВУпрВалюте", "Столбец_14");
	СоответствиеКолонок.Вставить("СуммаВТенге", "Столбец_13");
	СоответствиеКолонок.Вставить("СуммаВВалюте", "Столбец_12");
	СоответствиеКолонок.Вставить("Валюта", "Столбец_11");
	//СоответствиеКолонок.Вставить("Столбец_10", "ТипРегистратора");  для остатков непонятно чем специалисты SAP его заполнили
	СоответствиеКолонок.Вставить("Счет_Наименование", "Столбец_9");
	СоответствиеКолонок.Вставить("Счет_Код", "Столбец_8");
	СоответствиеКолонок.Вставить("Период_Месяц", "Столбец_7");
	СоответствиеКолонок.Вставить("Период_Год", "Столбец_6");
	//СоответствиеКолонок.Вставить("Столбец_5", "Подразделение"); В подразделение переносим данные из колонки "Структурное подразделение". Это подразделение опускаем
	СоответствиеКолонок.Вставить("ДатаВвода", "Столбец_4" ); //информации в выгрузке нет 
	СоответствиеКолонок.Вставить("Период", "Столбец_3");
	СоответствиеКолонок.Вставить("Подразделение", "Столбец_2");
	СоответствиеКолонок.Вставить("Подразделение_Код", "Столбец_1");
	
	Возврат СоответствиеКолонок;

КонецФункции // ПолучитьСоответсвиеДляОборотов()

&НаСервере
Функция ПолучитьСоответсвияТипов(База) Экспорт

	СоответствиеКолонок =  Новый Соответствие;
	СоответствиеКолонок.Вставить("Валюта", ПолучитьТипОбъекта(База, "Справочник.Валюты"));
	СоответствиеКолонок.Вставить("Подразделения", ПолучитьТипОбъекта(База, "Справочник.ПодразделенияОрганизаций"));

	СоответствиеКолонок.Вставить("Кассы",ПолучитьТипОбъекта(База, "Справочник.Кассы") );
	СоответствиеКолонок.Вставить("БанковскиеСчета",ПолучитьТипОбъекта(База, "Справочник.БанковскиеСчета") );
	СоответствиеКолонок.Вставить("Контрагенты",ПолучитьТипОбъекта(База, "Справочник.Контрагенты") );
	СоответствиеКолонок.Вставить("Договоры",ПолучитьТипОбъекта(База, "Справочник.ДоговорыКонтрагентов") );
	СоответствиеКолонок.Вставить("Номенклатура",ПолучитьТипОбъекта(База, "Справочник.Номенклатура") );
	СоответствиеКолонок.Вставить("Склады",ПолучитьТипОбъекта(База, "Справочник.Склады") );
	СоответствиеКолонок.Вставить("ЦенныеБумаги",ПолучитьТипОбъекта(База, "Справочник.ЦенныеБумаги") );
	СоответствиеКолонок.Вставить("РасходыБудущихПериодов",ПолучитьТипОбъекта(База, "Справочник.РасходыБудущихПериодов") );
	СоответствиеКолонок.Вставить("ДоходыБудущихПериодов",ПолучитьТипОбъекта(База, "Справочник.ДоходыБудущихПериодов") );
	СоответствиеКолонок.Вставить("СтатьиДоходов",ПолучитьТипОбъекта(База, "Справочник.Доходы") );
	СоответствиеКолонок.Вставить("СтатьиЗатрат",ПолучитьТипОбъекта(База, "Справочник.СтатьиЗатрат") );
	СоответствиеКолонок.Вставить("СтатьиДвиженияДенежныхСредств",ПолучитьТипОбъекта(База, "Справочник.СтатьиДвиженияДенежныхСредств") );
	СоответствиеКолонок.Вставить("ОсновныеСредства",ПолучитьТипОбъекта(База, "Справочник.ОсновныеСредства") );
	СоответствиеКолонок.Вставить("НематериальныеАктивы",ПолучитьТипОбъекта(База, "Справочник.НематериальныеАктивы") );
	СоответствиеКолонок.Вставить("ОбъектыСтроительства",ПолучитьТипОбъекта(База, "Справочник.ОбъектыСтроительства") );
	СоответствиеКолонок.Вставить("НоменклатурныеГруппы",ПолучитьТипОбъекта(База, "Справочник.НоменклатурныеГруппы") );
				
	Возврат СоответствиеКолонок;
	
КонецФункции // ПолучитьСоответсвияТипов()

#КонецОбласти
